htmls/android-root.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-27 Wed 00:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Android Root 过程记录(nexus5x版)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThankFly" />
<meta name="description" content="process of android root(nexus5x)"
 />
<meta name="keywords" content="root,解密" />
<link rel="stylesheet" type="text/css" href="../media/stylesheets/org.css">
</head>
<body>
<div id="content">
<h1 class="title">Android Root 过程记录(nexus5x版)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9683297">1. root的好处</a></li>
<li><a href="#org23f3930">2. nexus5x 的root过程</a>
<ul>
<li><a href="#org7ac8189">2.1. 解锁~</a></li>
<li><a href="#orgb058b80">2.2. 刷Recovery</a>
<ul>
<li><a href="#orgbeab0b8">2.2.1. 首先,一定要注意，twrp和cwm以及后面的superSU都要从官网下！！！！官网！！！这里给个 twrp 的官网链接.</a></li>
<li><a href="#org747b0d5">2.2.2. 然后提个醒，刷完recovery之后直接就要把superSU刷进去，所以事先要把superSU.zip放在手机里面一个明显的地方.</a></li>
<li><a href="#org4419d52">2.2.3. 最后需要做的就是，下个twrp 或者 cwm　recovery然后通过之前的fastboot 执行 fastboot flash recovery **.img 就可以了(手机处于fastboot模式下)</a></li>
</ul>
</li>
<li><a href="#org5e40921">2.3. 刷superSU</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9683297" class="outline-2">
<h2 id="org9683297"><span class="section-number-2">1</span> root的好处</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>root</b> 之后你才是手机真正的主人～，本来不能删的预装软件现在可以删了（不过我一般不删，怕真的把系统给弄崩了). 可以更高效地使用像greenify，icebox(必须root)这类需要root权限的软件.当然,root了之后还有其他各种与以往不同的玩法．
</p>
</div>
</div>

<div id="outline-container-org23f3930" class="outline-2">
<h2 id="org23f3930"><span class="section-number-2">2</span> nexus5x 的root过程</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7ac8189" class="outline-3">
<h3 id="org7ac8189"><span class="section-number-3">2.1</span> 解锁~</h3>
<div class="outline-text-3" id="text-2-1">
<p>
首先,要解锁,（解密解锁都是android的保护机制,不解锁就刷不了recovery,而一般的root过程就是通过recovery往系统里装一个superSU的程序，所以必须一步一步来，先解锁，然后刷recovery,再通过recovery刷superSU的包),关机状态下按住开机和音量下键可以进入fastboot模式．可以看到显示的画面里底部显示状态为locked(也就是被锁的状态).原则上这个时候需要在命令行下执行 fastboot oem unlock 就可以解锁了．感觉上很简单，就是需要连接一下电脑，然后执行一条命令．(.^.)不过，需要注意的在电脑上执行fastboot命令时需要该fastboot能识别出nexus5x.本来下了个linux版的fastboot，可是无法识别出已经连接的设备；恩，无奈最后换成windows10，按照这个链接 <a href="http://www.teamandroid.com/2016/09/08/root-nexus-5x-android-7-0-nrd90s-nougat-security-update/">root </a>的指示安好了驱动（在这个过程中我是下载了android sdk,里面的extra有google的通用设备驱动,然后更新安装设备管理器里的驱动)，fastboot终于能识别手机了．在之前所说的fastboot模式下,通过数据线连上电脑．然后打开命令行，执行 fastboot oem unclock (注意此时如果执行fastboot devices应该是可以看到设备的，看不到就是驱动没装好)
</p>
</div>
</div>

<div id="outline-container-orgb058b80" class="outline-3">
<h3 id="orgb058b80"><span class="section-number-3">2.2</span> 刷Recovery</h3>
<div class="outline-text-3" id="text-2-2">
<p>
这个过程我想说三点：
</p>
</div>
<div id="outline-container-orgbeab0b8" class="outline-4">
<h4 id="orgbeab0b8"><span class="section-number-4">2.2.1</span> 首先,一定要注意，twrp和cwm以及后面的superSU都要从官网下！！！！官网！！！这里给个 <a href="https://twrp.me/Devices/">twrp</a> 的官网链接.</h4>
</div>
<div id="outline-container-org747b0d5" class="outline-4">
<h4 id="org747b0d5"><span class="section-number-4">2.2.2</span> 然后提个醒，刷完recovery之后直接就要把superSU刷进去，所以事先要把superSU.zip放在手机里面一个明显的地方.</h4>
</div>
<div id="outline-container-org4419d52" class="outline-4">
<h4 id="org4419d52"><span class="section-number-4">2.2.3</span> 最后需要做的就是，下个twrp 或者 cwm　recovery然后通过之前的fastboot 执行 fastboot flash recovery **.img 就可以了(手机处于fastboot模式下)</h4>
</div>
</div>

<div id="outline-container-org5e40921" class="outline-3">
<h3 id="org5e40921"><span class="section-number-3">2.3</span> 刷superSU</h3>
<div class="outline-text-3" id="text-2-3">
<p>
按音量键切换到recovery模式下,或是刷入，或是安装,选择之前的superSU.zip，然后应该就算是root成功了(开机之后系统会多一个superSU软件)
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2016-11-12</p>
<p class="author">Author: ThankFly</p>
<p class="date">Created: 2019-02-27 Wed 00:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>